const mapping = [
  ["Alertness", "警覺", "44-24"],
  ["Ambition", "野心", "54-53"],
  ["Articulation", "表達", "12-11"],
  ["Assimilation", "同化", "23-43"],
  ["Bargains", "協商", "37-40"],
  ["Beginnings", "開始", "53-54"],
  ["Behavior", "行為舉止", "10-15"],
  ["Caring", "滋養", "27-28"],
  ["Commitment", "承諾", "29-30"],
  ["Completion", "完成", "42-32"],
  ["Conflict", "衝突", "6-36"],
  ["Confution", "困惑", "64-63"],
  ["Conservation", "保育", "32-42"],
  ["Contribution", "貢獻", "8-14"],
  ["Control", "控制", "21-48"],
  ["Correction", "修正", "18-17"],
  ["Crisis", "危機", "36-6"],
  ["Denial", "拒絕", "40-37"],
  ["Depth", "深度", "48-21"],
  ["Detail", "細節", "62-61"],
  ["Doubts", "懷疑", "63-64"],
  ["Driver", "駕駛", "2-1"],
  ["Empowering", "賦權", "14-8"],
  ["Experience", "經驗", "35-5"],
  ["Experimentation", "實驗", "16-9"],
  ["Extremes", "極端", "15-10"],
  ["Fantasy", "幻想", "41-31"],
  ["Fates", "命運", "30-29"],
  ["Focus", "專注", "9-16"],
  ["Formulization", "公式", "4-49"],
  ["Grace", "優雅", "22-47"],
  ["Habits", "習慣", "5-35"],
  ["Ideas", "想法", "11-12"],
  ["Influence", "影嚮力", "31-41"],
  ["Innocence", "純真", "25-46"],
  ["Insight", "洞見", "43-23"],
  ["Interaction", "互動", "7-13"],
  ["Intuition", "直覺", "57-51"],
  ["Limitation", "限制", "60-56"],
  ["Listening", "傾聽", "13-7"],
  ["Maia 1", "瑪雅 1", "42-32"],
  ["Mask 1", "面具 1", "13-7"],
  ["Moods", "情緒", "55-59"],
  ["Mutation", "突變", "3-50"],
  ["Need", "需求", "19-33"],
  ["Now", "當下", "20-34"],
  ["Opinions", "建議", "17-18"],
  ["Opposition", "反對", "38-39"],
  ["Oppression", "壓抑", "47-22"],
  ["Possesion", "佔有", "45-26"],
  ["Power", "力量", "34-20"],
  ["Principle", "原則", "49-4"],
  ["Provocation", "挑釁", "39-38"],
  ["Rationalization", "合理化", "24-44"],
  ["Retreat", "退隱", "33-19"],
  ["Risk", "風險", "28-27"],
  ["Self Expression", "自我表達", "1-2"],
  ["Serendipity", "機遇", "46-25"],
  ["Shock", "驚嚇", "51-57"],
  ["Stillness", "靜止不動", "52-58"],
  ["Stimulation", "刺激", "56-60"],
  ["Strategy", "策略", "59-55"],
  ["Thinking", "思考", "61-62"],
  ["Trickster", "幻術師", "26-45"],
  ["Values", "價值", "50-3"],
  ["Vitality", "生命力", "58-52"],

  ["Alignment 1", "結盟 1", "27-28"],
  ["Alignment 2", "結盟 2", "28-27"],
  ["Alpha 1", "領導 1", "31-41"],
  ["Alpha 2", "領導 2", "41-31"],
  ["Clarion 1", "號角 1", "51-57"],
  ["Clarion 2", "號角 2", "57-51"],
  ["Confrontation 1", "對峙 1", "45-26"],
  ["Confrontation 2", "對峙 2", "26-45"],
  ["Cycles 1", "迴圈 1", "53-54"],
  ["Cycles 2", "迴圈 2", "54-53"],
  ["Dedication 1", "奉獻 1", "23-43"],
  ["Dedication 2", "奉獻 2", "43-23"],
  ["Defiance 1", "違抗 1", "2-1"],
  ["Defiance 2", "違抗 2", "1-2"],
  ["Demands 1", "要求 1", "52-58"],
  ["Demands 2", "要求 2", "58-52"],
  ["Distraction 1", "分心1", "56-60"],
  ["Distraction 2", "分心 2", "60-56"],
  ["Dominion 1", "支配 1", "63-64"],
  ["Dominion 2", "支配 2", "64-63"],
  ["Duality 1", "二元性 1", "20-34"],
  ["Duality 2", "二元性 2", "34-20"],
  ["Education 1", "教育 1", "12-11"],
  ["Education 2", "教育 2", "11-12"],
  ["Endeavor 1", "努力 1", "21-48"],
  ["Endeavor 2", "努力 2", "48-21"],
  ["Healing 1", "療癒 1", "25-46"],
  ["Healing 2", "療癒 2", "46-25"],
  ["Identification 1", "指認 1", "16-9"],
  ["Identification 2", "指認 2", "9-16"],
  ["Incarnation 1", "輪迴 1", "24-44"],
  ["Incarnation 2", "輪迴 2", "44-24"],
  ["Individualism 1", "個人主義 1", "39-38"],
  ["Individualism 2", "個人主義 2", "38-39"],
  ["Industry 1", "勤奮", "30-29"],
  ["Industry 2", "勤奮 2", "29-30"],
  ["Informing 1", "告知 1", "22-47"],
  ["Informing 2", "告知 2", "47-22"],
  ["Limitation 1", "限制 1", "42-32"],
  ["Limitation 2", "限制 2", "32-42"],
  ["Migration 1", "遷徙1", "37-40"],
  ["Migration 2", "遷徙 2", "40-37"],
  ["Obscuration 1", "晦澀 1", "62-61"],
  ["Obscuration 2", "晦澀 2", "61-62"],
  ["Plane 1", "物質層面 1", "36-6"],
  ["Plane 2", "物質層面 2", "6-36"],
  ["Prevention 1", "預防 1", "15-10"],
  ["Prevention 2", "預防 2", "10-15"],
  ["Refinement 1", "精鍊 1", "33-19"],
  ["Refinement 2", "精煉 2", "19-33"],
  ["Revolution 1", "革命 1", "49-4"],
  ["Revolution 2", "革命 2", "4-49"],
  ["Seperation 1", "分離 1", "35-5"],
  ["Seperation 2", "分離 2", "5-35"],
  ["Spirit 1", "靈魂 1", "55-59"],
  ["Spirit 2", "靈魂 2", "59-55"],
  ["Uncertainty 1", "不確定 1", "8-14"],
  ["Uncertainty 2", "不確定 2", "14-8"],
  ["Upheaval 1", "動盪 1", "17-18"],
  ["Upheaval 2", "動盪 2", "18-17"],
  ["Wishes 1", "希望 1", "3-50"],
  ["Wishes 2", "希望 2", "50-3"],

  ["Consciousness 1", "意識 1", "63-64"],
  ["Consciousness 2", "意識 2", "35-5"],
  ["Consciousness 3", "意識 3", "64-63"],
  ["Consciousness 4", "意識 4", "5-35"],
  ["Contagion 1", "感染 1", "30-29"],
  ["Contagion 2", "感染 2", "8-14"],
  ["Contagion 3", "感染 3", "29-30"],
  ["Contagion 4", "感染 4", "14-8"],
  ["Eden 1", "伊甸園 1", "36-6"],
  ["Eden 2", "伊甸園 2", "12-11"],
  ["Eden 3", "伊甸園 3", "6-36"],
  ["Eden 4", "伊甸園 4", "11-12"],
  ["Explanation 1", "解釋 1", "49-4"],
  ["Explanation 2", "解釋 2", "23-43"],
  ["Explanation 3", "解釋 3", "4-49"],
  ["Explanation 4", "解釋 4", "43-23"],
  ["Four Ways 1", "四方之路 1", "24-44"],
  ["Four Ways 2", "四方之路 2", "33-19"],
  ["Four Ways 3", "四方之路 3", "44-24"],
  ["Four Ways 4", "四方之路 4", "19-33"],
  ["Law 1", "律法 1", "3-50"],
  ["Law 2", "律法 2", "56-60"],
  ["Law 3", "律法 3", "50-3"],
  ["Law 4", "律法 4", "60-56"],
  ["Mask 2", "面具 2", "7-13"],
  ["Maya 2", "瑪雅 2", "62-61"],
  ["Maya 3", "瑪雅 3", "32-42"],
  ["Maya 4", "瑪雅 4", "61-62"],
  ["Penetration 1", "滲透 1", "51-57"],
  ["Penetration 2", "滲透 2", "53-54"],
  ["Penetration 3", "滲透 3", "57-51"],
  ["Penetration 4", "滲透 4", "54-53"],
  ["Planning 1", "計畫 1", "37-40"],
  ["Planning 2", "計畫 2", "16-9"],
  ["Planning 3", "計畫 3", "40-37"],
  ["Planning 4", "計畫 4", "9-16"],
  ["Rulership 1", "統領 1", "22-47"],
  ["Rulership 2", "統領 2", "45-26"],
  ["Rulership 3", "統領 3", "47-22"],
  ["Rulership 4", "統領 4", "26-45"],
  ["Service 1", "服務 1", "17-18"],
  ["Service 2", "服務 2", "52-58"],
  ["Service 3", "服務 3", "18-17"],
  ["Service 4", "服務 4", "58-52"],
  ["Sleeping Phoenix 1", "沈睡的鳳凰 1", "55-59"],
  ["Sleeping Phoenix 2", "沈睡的鳳凰 2", "20-34"],
  ["Sleeping Phoenix 3", "沈睡的鳳凰 3", "59-55"],
  ["Sleeping Phoenix 4", "沈睡的鳳凰 4", "34-20"],
  ["Sphinx 1", "人面獅身 1", "13-7"],
  ["Sphinx 2", "人面獅身 2", "2-1"],
  ["Sphinx 3", "人面獅身 3", "7-13"],
  ["Sphinx 4", "人面獅身 4", "1-2"],
  ["Tension 1", "張力 1", "21-48"],
  ["Tension 2", "張力 2", "39-38"],
  ["Tension 3", "張力 3", "48-21"],
  ["Tension 4", "張力 4", "38-39"],
  ["Unexpected 1", "不預期 1", "27-28"],
  ["Unexpected 2", "不預期 2", "31-41"],
  ["Unexpected 3", "不預期 3", "28-27"],
  ["Unexpected 4", "不預期 4", "41-31"],
  ["Vessel of Love 1", "愛的器皿 1", "25-46"],
  ["Vessel of Love 2", "愛的器皿 2", "15-10"],
  ["Vessel of Love 3", "愛的器皿 3", "46-25"],
  ["Vessel of Love 4", "愛的器皿 4", "10-15"],
];

export function cross(x: number) {
  const [_en, zh, tunnel] = mapping.at(x) ?? [];
  const angle = x <= 65 ? "並列" : x <= 128 ? "左角度" : "右角度";
  return `${angle}交叉之${zh} (${tunnel})`;
}

/*
0 並列交叉之警覺 (44/24 | 7/13)
1 並列交叉之野心 (54/53 | 32/42)
63 並列交叉之活力 (58/52 | 48/21)
73 左角度交叉之循環 (54/53 | 32/42)
76 左角度交叉之反抗 (2/1 | 49/4)
79 左角度交叉之要求 (58/52 | 48/21)
81 左角度交叉之分心 (60/56 | 28/27)
84 左角度交叉之二元性 (20/34 | 37/40)
86 左角度交叉之教育 (12/11 | 25/46)
98 左角度交叉之勤奮 (30/29 | 34/20)
101 左角度交叉之告知 (47/22 | 12/11)
104 左角度交叉之面具 (13/7 | 43/23)
110 左角度交叉之物質層面 (36/6 | 10/15)
115 左角度交叉之精緻 (19/33 | 1/2)
116 左角度交叉之革命 (49/4 | 14/8)
117 左角度交叉之革命 (4/49 | 8/14)
118 左角度交叉之分離 (35/5 | 22/47)
119 左角度交叉之分離 (5/35 | 47/22)
120 左角度交叉之心靈 (55/59 | 9/16)
121 左角度交叉之心靈 (59/55 | 16/9)
122 左角度交叉之不確定 (8/14 | 55/59)
123 左角度交叉之不確定 (14/8 | 59/55)
124 左角度交叉之動盪 (17/18 | 38/39)
125 左角度交叉之動盪 (18/17 | 39/38)
126 左角度交叉之願望 (3/50 | 41/31)
127 左角度交叉之願望 (50/3 | 31/41)
128 右角度交叉之意識 (63/64 | 5/35)
129 右角度交叉之意識 (35/5 | 63/64)
130 右角度交叉之意識 (64/63 | 35/5)
131 右角度交叉之意識 (5/35 | 64/63)
132 右角度交叉之感染力 (30/29 | 14/8)
133 右角度交叉之感染力 (8/14 | 30/29)
134 右角度交叉之感染力 (29/30 | 8/14)
135 右角度交叉之感染力 (14/8 | 29/30)
136 右角度交叉之伊甸園 (36/6 | 11/12)
137 右角度交叉之伊甸園 (12/11 | 36/6)
138 右角度交叉之伊甸園 (6/36 | 12/11)
139 右角度交叉之伊甸園 (11/12 | 6/36)
140 右角度交叉之說明 (49/4 | 43/23)
141 右角度交叉之說明 (23/43 | 49/4)
142 右角度交叉之說明 (4/49 | 23/43)
143 右角度交叉之說明 (43/23 | 4/49)
144 右角度交叉之四方之路 (24/44 | 19/33)
145 右角度交叉之四方之路 (33/19 | 24/44)
146 右角度交叉之四方之路 (44/24 | 33/19)
147 右角度交叉之四方之路 (19/33 | 44/24)
148 右角度交叉之律法 (3/50 | 60/56)
149 右角度交叉之律法 (56/60 | 3/50)
150 右角度交叉之律法 (50/3 | 56/60)
151 右角度交叉之律法 (60/56 | 50/3)
152 右角度交叉之馬雅 (42/32 | 61/62)
153 右角度交叉之馬雅 (62/61 | 42/32)
154 右角度交叉之馬雅 (32/42 | 32/42)
155 右角度交叉之馬雅 (61/62 | 32/42)
156 右角度交叉之穿透 (51/57 | 54/53)
157 右角度交叉之穿透 (53/54 | 51/57)
158 右角度交叉之穿透 (57/51 | 53/54)
159 右角度交叉之穿透 (54/53 | 57/51)
160 右角度交叉之計畫 (37/40 | 9/16)
161 右角度交叉之計畫 (16/9 | 37/40)
162 右角度交叉之計畫 (40/37 | 16/9)
163 右角度交叉之計畫 (9/16 | 40/37)
164 右角度交叉之領導力 (22/47 | 26/45)
165 右角度交叉之領導力 (45/26 | 22/47)
166 右角度交叉之領導力 (47/22 | 45/26)
167 右角度交叉之領導力 (26/45 | 47/22)
168 右角度交叉之服務 (17/18 | 58/52)
169 右角度交叉之服務 (52/58 | 17/18)
170 右角度交叉之服務 (18/17 | 52/58)
171 右角度交叉之服務 (58/52 | 18/17)
172 右角度交叉之沈睡鳳凰 (55/59 | 34/20)
173 右角度交叉之沈睡鳳凰 (20/34 | 55/59)
174 右角度交叉之沈睡鳳凰 (59/55 | 20/34)
175 右角度交叉之沈睡鳳凰 (34/20 | 59/55)
176 右角度交叉之人面獅身 (13/7 | 1/2)
177 右角度交叉之人面獅身 (2/1 | 13/7)
178 右角度交叉之人面獅身 (7/13 | 2/1)
179 右角度交叉之人面獅身 (1/2 | 7/13)
180 右角度交叉之張力 (21/48 | 38/39)
181 右角度交叉之張力 (39/38 | 21/48)
182 右角度交叉之張力 (48/21 | 39/38)
183 右角度交叉之張力 (38/39 | 48/21)
184 右角度交叉之意料之外 (27/28 | 41/31)
185 右角度交叉之意料之外 (31/41 | 27/28)
186 右角度交叉之意料之外 (28/27 | 31/41)
187 右角度交叉之意料之外 (41/31 | 28/27)
188 右角度交叉之愛的器皿 (25/46 | 10/15)
189 右角度交叉之愛的器皿 (15/10 | 25/46)
190 右角度交叉之愛的器皿 (46/25 | 15/10)
191 右角度交叉之愛的器皿 (10/15 | 46/25)
*/
